In [1]:
# To create the summary DataFrame, follow these steps:
# Get the total rides, total drivers, and total fares for each city type using the groupby() 
# function on the city type using the merged DataFrame or separate DataFrames.
# Calculate the average fare per ride and the average fare per driver by city type.
# Delete the index name.
# Create the summary DataFrame with the appropriate columns and apply formatting where appropriate.

In [2]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [3]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [4]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [21]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [22]:
# Create the Suburban and Rural city DataFrames.
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]

In [7]:
# Create a summary DataFrame that showcases the following for each city type:
# Total Rides
# Total Drivers
# Total Fares
# Average Fare per Ride
# Average Fare per Drive

In [44]:
# Get the total rides
total_ride_df = pyber_data_df.groupby(["type"]).count()["ride_id"].map("{:,}".format)
total_ride_df

type
Rural         125
Suburban      625
Urban       1,625
Name: ride_id, dtype: object

In [43]:
# Get the total drivers
total_drivers_df = city_data_df.groupby(["type"]).sum()["driver_count"].map("{:,}".format)
total_drivers_df

type
Rural          78
Suburban      490
Urban       2,405
Name: driver_count, dtype: object

In [41]:
# Get The total Fares
total_fares_df = pyber_data_df.groupby(["type"]).sum()["fare"].map("${:,.2f}".format)
total_fares_df

type
Rural        $4,327.93
Suburban    $19,356.33
Urban       $39,854.38
Name: fare, dtype: object

In [42]:
# Get the average fare per ride
average_fare_ride = pyber_data_df.groupby(["type"]).mean()["fare"].map("${:,.2f}".format)
average_fare_ride

type
Rural       $34.62
Suburban    $30.97
Urban       $24.53
Name: fare, dtype: object

In [53]:
# Get average fare per driver
average_fare_driver =pyber_data_df.groupby(["type"]).mean()["driver_count"].map("${:,.2f}".format)
average_fare_driver

type
Rural        $4.30
Suburban    $13.71
Urban       $36.68
Name: driver_count, dtype: object

In [54]:
pyber_summary_df = pd.DataFrame({
    "Total Ride": total_ride_df,
    "Total Drivers": total_drivers_df,
    "Total Fares": total_fares_df,
    "Average Fare per Ride":average_fare_ride,
    "Average Fare per Driver":average_fare_driver
     
})
pyber_summary_df

,Total Ride,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,"$4,327.93",$34.62,$4.30
Suburban,625,490,"$19,356.33",$30.97,$13.71
Urban,"1,625","2,405","$39,854.38",$24.53,$36.68

In [14]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

In [15]:
# Rename columns 
pyber_data = pyber_data_df.rename(columns={'city': 'City', 'date':'Date','fare':'Fare', 'ride_id': 'Ride Id',
                           'driver_count': 'No. Drivers', 'type':'City Type'}).head()
pyber_data.head()

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [58]:
# Set index to Date column
pyber_data_df = pyber_data.set_index("Date")
pyber_data_df.head()

,City,Fare,Ride Id,No. Drivers,City Type
Date,,,,,
2019-01-14 10:14:22,Lake Jonathanshire,13.83,5739410935873,5,Urban
2019-03-04 18:24:09,South Michelleport,30.24,2343912425577,72,Urban
2019-02-24 04:29:00,Port Samanthamouth,33.44,2005065760003,57,Urban
2019-02-10 23:22:03,Rodneyfort,23.44,5149245426178,34,Urban
2019-03-06 04:28:35,South Jack,34.58,3908451377344,46,Urban

In [92]:
# Create a new DataFrame for fares and include only the Date, City Type, and Fare columns 
# using the copy() method on the merged DataFrame.
# newdataframe=olddataframe.copy()[ [ "the columns", "you want", "to copy" ] ]

fares_df = pyber_data_df.copy()[["City","City Type","Fare"]] 
fares_df.head()

                                   City City Type   Fare
Date
2019-01-14 10:14:22  Lake Jonathanshire     Urban  13.83
2019-03-04 18:24:09  South Michelleport     Urban  30.24
2019-02-24 04:29:00  Port Samanthamouth     Urban  33.44
2019-02-10 23:22:03          Rodneyfort     Urban  23.44
2019-03-06 04:28:35          South Jack     Urban  34.58

In [76]:
# Set the index to the datetime data type

In [ ]:
# Check the DataFrame using the info() method to make sure the index is a datetime data type.

In [97]:
# Calculate the sum() of fares by the type of city and date using groupby() to create a new DataFrame.
sum_of_fares = fares_df.groupby(["City Type"]).sum()["Fare"]
sum_of_fares

City Type
Urban    135.53
Name: Fare, dtype: float64

In [91]:
# Create a pivot table DataFrame with the Date as the index and columns = 'City Type' with the Fare for each Date in each row
pivot_date_df = pyber_data_df.copy()[["City Type","Fare"]] 
pivot_date_df

                    City Type   Fare
Date
2019-01-14 10:14:22     Urban  13.83
2019-03-04 18:24:09     Urban  30.24
2019-02-24 04:29:00     Urban  33.44
2019-02-10 23:22:03     Urban  23.44
2019-03-06 04:28:35     Urban  34.58

In [ ]:
dates_df = pd.DataFrame(pivot_date_df.loc[pivot_date_df["Date"] == '2019-01-01':'2019-04-28'])